import { Recipe } from "@/types/recipe";

export const recipes: Recipe[] = [
  {
    name: "Булочка",
    id: "bulka",
    description: "Дивовижні булочки з мінімум калорій",
    photo: "/bulka.jpg",
    ingredients: ["яйця 1шт", "псиліум 1ст.л", "розпушувач 1ч.л.", "вода 30мл"],
    steps: [
      "Збийте яйця та додайте до них псиліум",
      "Ретельно перемішати додати гарячу воду та залишити на півгодини для набухання",
      "Духовку розігрійте до 200 градусів та випікайте хліб 25-30 хвилин.",
      "Дайте охолонути, залишивши його в духовці до повного остигання",
    ],
    kcal: { calories: 64, proteins: 2.7, fats: 0, carbs: 0.9 },
    category: "dessert",
    time: 25,
    ketoScore: 3,
  },

  {
    name: "Хліб",
    id: "hlib",
    description:
      "Іноді на кето дієті так хочеться хліба, щоб потішити себе класичним бутербродом чи тостом на сніданок. З цим простим рецептом мого кето-хліба можете не відмовляти собі в чомусь!",
    photo: "/hleb.png",
    ingredients: [
      "яйця 3шт",
      "псиліум 3ст.л",
      "розпушувач 1ч.л.",
      "кипяток 70гр",
      "льняне борошно 1ст.л",
    ],
    steps: [
      "Збийте яйця та додайте до них псиліум",
      "Ретельно перемішати додати гарячу воду та залишити на півгодини для набухання",
      "Духовку розігрійте до 200 градусів та випікайте хліб 35-40 хвилин.",
      "Дайте кето-хлібу охолонути, залишивши його в духовці до повного остигання",
    ],
    kcal: { calories: 64, proteins: 2.7, fats: 0, carbs: 0.9 },
    category: "dessert",
    time: 35,
    ketoScore: 1,
  },
];
